# Создаём переменную name и присваиваем ей строковое значение
name = "Ruslan"
print("Name:", name)  # Выводим значение переменной name

# Объяснение кода: 
# Создание переменной name:
# Переменная name содержит строку (тип данных str), которая представляет ваше имя.
# Выводится на экран с помощью print().

# Создаём переменную age и присваиваем ей числовое значение (целое число)
age = 28
print("Age:", age)  # Выводим значение переменной age

# Объяснение кода: 
# Создание переменной age:
# Переменная age содержит целое число (тип данных int), которое представляет ваш возраст.
# После инициализации значение переменной выводится на экран.

# Перезаписываем значение переменной age, добавляя новое значение
age = age + 1  # Увеличиваем значение переменной age на 1
print("New Age:", age)  # Выводим изменённое значение переменной age

# Объяснение кода: 
# Изменение значения переменной age:
# Переменной age присваивается её предыдущее значение, увеличенное на 1.
# Это демонстрирует возможность изменения значений переменных в Python.

# Создаём переменную is_student и присваиваем ей логическое значение True
is_student = True
print("Is Student:", is_student)  # Выводим значение переменной is_student

# Объяснение кода: 
# Создание переменной is_student:
# Переменная is_student содержит логическое значение True (тип данных bool).
# Это пример использования логического типа данных.
